---
kind: enumMember
id: F:Autodesk.Revit.DB.BRepBuilderOutcome.Success
enum: Autodesk.Revit.DB.BRepBuilderOutcome
source: html/d0512eec-4b27-81a4-9327-98eaf1fedf12.htm
---
# Autodesk.Revit.DB.BRepBuilderOutcome.Success

The function has completed successfully.